# OpenLoopError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..OpenLoopError Property
BuiltInFailures..::..SketchFailures Class See Also
---
Lines must be in closed loops. The highlighted lines are open on one end.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OpenLoopError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OpenLoopError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OpenLoopError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace